In [7]:
import mysql.connector
database = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "",
    database = "cafe"
)
db = database.cursor()

In [5]:
db.execute("SELECT * FROM staff")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 33, 'kathmandu', 983737463, 'manager', 20000)
(2, 'Shyam', 31, 'pokhara', 984756455, 'waiter', 10000)
(3, 'Neema', 24, 'dhading', 984756394, 'waiter', 10000)

In [8]:
sql = "INSERT INTO staff(Name,Age,Address,Phone,Position,Salary) VALUES('Radha',43,'Chitwan',9484847754,'chef',30000)"
db.execute(sql)
database.commit()
print(db.rowcount,"record inserted.")

1 record inserted.

In [11]:
n = int(input("Enter n = "))
for i in range(n):
    Name = input("Enter name = ")
    Age = int(input("Enter age = "))
    Address = input("Enter address = ")
    Phone = int(input("Enter phone no. = "))
    Position = input("Enter position = ")
    Salary = input("Enter salary = ")
    sql = f"INSERT INTO staff(Name,Age,Address,Phone,Position,Salary) VALUES('{Name}',{Age},'{Address}',{Phone},'{Position}',{Salary})"
    db.execute(sql)
database.commit()

Enter n = 1
Enter name = Nabin
Enter age = 34
Enter address = kathmandu
Enter phone no. = 9348484845
Enter position = manager
Enter salary = 20000

In [14]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    age = int(input("Enter age = "))
    add = input("Enter add = ")
    phone = int(input("Enter phone no. = "))
    position = input("Enter position = ")
    salary = int(input("Enter salary = "))
    sql = f"INSERT INTO staff(Name,Age,Address,Phone,Position,Salary) VALUES('{name}',{age},'{add}',{phone},'{position}',{salary})"
    db.execute(sql)
database.commit()

Enter n = 1
Enter name = Neema
Enter age = 34
Enter add = pokhara
Enter phone no. = 948487437
Enter position = chef
Enter salary = 30000

In [17]:
id = int(input("Enter id = "))
sql = f"DELETE FROM staff WHERE id = {id}"
db.execute(sql)
database.commit()

Enter id = 6

In [18]:
db.execute("SELECT * FROM staff")
result = db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 33, 'kathmandu', '983737463', 'manager', 20000)
(2, 'Shyam', 31, 'pokhara', '9847564556767', 'waiter', 10000)
(3, 'Neema', 24, 'dhading', '984756394', 'waiter', 10000)
(4, 'Radha', 43, 'Chitwan', '9484847754', 'chef', 30000)
(5, 'Nabin', 34, 'kathmandu', '9348484845', 'manager', 20000)

In [20]:
field = input("Enter field (id,name,address,position) = ")
value = input("Enter value = ")
sql = f"DELETE FROM staff WHERE field = '{value}'"
db.execute(sql)
database.commit()

Enter field (id,name,address,position) = Name
Enter value = Radha

ProgrammingError: 1054 (42S22): Unknown column 'field' in 'where clause'